{
    "title": "kjch's Homepage",
    "subtitle": "Welcome to my Personal Website",
    "pageTitle": "kjch's Homepage",
    "about": {
        "title": "About Me",
        "content": "The happiest moment is when you're still chasing your dreams. Life is like a journey, and I am just a traveler.",
        "intro": "Hello, I'm Kuang Jiacheng.",
        "description": "I love the internet and enjoy exploring new things (like games). I'm curious about this interesting world and you who have discovered this place (｡･∀･)ﾉﾞ",
        "current": "I'm currently a high school student in Ohio, USA. In my spare time, I try to develop some websites and other small tools. Occasionally, I also work on my own projects. I'm the creator of the Moe-Counter website counter. To commemorate my three years of junior high school life (7th-9th grade) at Beijing Zhongde School, I developed the ZDSchool project upon graduation.",
        "interest": "If you're interested in me, you can click here to roll a tag about me. You can also follow me on social media below, or feel free to contact me via email, WeChat, or QQ (。・∀・)ノ",
        "hope": "I hope to meet you under the stars of the bit sea!"
    },
    "skills": {
        "title": "My Skills"
    },
    "projects": {
        "title": "Latest Projects",
        "viewAll": "View All Projects",
        "viewProject": "View Project",
        "zdSchool": {
            "title": "ZDSchool Project",
            "description": "A website for showcasing the architectural achievements of Class 3 students in Minecraft.",
            "details": "A simple site showcasing the recreation of Zhongde School in Minecraft. This project is still ongoing and will be continued by the next batch of students, serving as an emotional continuation.",
            "tags": ["Website", "Graduation Project"]
        },
        "graduationVideo": {
            "title": "2022 Junior High Graduation Video",
            "description": "A final gift for classmates at graduation",
            "details": "I personally think this video was made too hastily, and many planned contents were not included, which is a bit regrettable. After multiple revisions and photo selections in a short period, it was finally presented to all junior high graduates. 2019-2022, a wonderful junior high school time...",
            "tags": ["Video", "Graduation Memorial"]
        },
        "zdSchoolMinecraft": {
            "title": "ZDSchool on Minecraft",
            "description": "A group of 2022 graduates recreated Zhongde School in Minecraft.",
            "details": "An ongoing project, the first time building such a large-scale structure in Minecraft, fulfilling our dream of recreating the school in Minecraft. Some buildings in the map are still under construction, and the update progress is very slow. (No update plans for now...)",
            "tags": ["Minecraft", "Graduation Project"]
        },
        "frcStrategyCharts": {
            "title": "FRC Robotics Strategy Charts",
            "description": "Strategy query charts designed for the robotics team",
            "details": "Facilitates quick decision-making for the team. Allows horizontal comparison of details by selecting any team. Focused on application, forgot to beautify the page (awkward). Click to preview the web version (the page is a bit ugly)",
            "tags": ["FRC", "Robotics", "Team 695", "Beachwood High School"]
        },
        "frcWebsite": {
            "title": "FRC Team 695 Bison Robotics · Official Website",
            "description": "Official website designed for the school's robotics team",
            "details": "The school robotics team finally has an official website. Almost single-handedly supported the entire team's website front-end and back-end design and development. Revised 4-5 versions of the plan, the page still looks a bit ugly (not really). This project is open source on Github.",
            "tags": ["FRC", "Official Website", "Robotics", "Team 695", "Beachwood High School"]
        }
    },
    "footer": {
        "copyright": "© 2019-2024. All rights reserved. Made with 💖 by kjch"
    },
    "language": {
        "en": "English",
        "zh": "中文"
    },
    "socialLinks": {
        "wechatTooltip": "WeChat: kjch666FFF",
        "qqTooltip": "QQ: 1834423612"
    }
}